## Create the grades conversor using a new class

In this notebook I show how the class works

In [2]:
from grades_class import *
import climb_jor

In [3]:
routes = pd.read_csv('../data/routes_rated.csv',low_memory=False, index_col=0)
routes.head(2)

,name_id,country,name,crag,sector,grade_median,tall_recommend,sex_ratio,cluster,rating_tot
0,0,arg,barba roja,el trebol,pared blanca,48.5,0,0.090909,0,0.436452
1,1,arg,chaco palai,el trebol,pared blanca,65.0,0,0.000000,0,-1.745950

Instance the class

In [4]:
gr = grades()

Grades class initialized

In [5]:
df = climb_jor.Sector_search(routes,'el vermell')
df.head(3)

,name_id,country,name,crag,sector,grade_median,tall_recommend,sex_ratio,cluster,rating_tot
8621,8621,esp,120 tronkaes,montserrat,el vermell,47.5,0,0.000000,0,-0.154807
8622,8622,esp,45 aniversari,montserrat,el vermell,40.0,-3,0.129032,2,0.230098
8623,8623,esp,almogaver tossut,montserrat,el vermell,33.0,0,0.166667,0,0.443842

In [6]:
df2 = df.copy()
df2['grade_fra'] = df2.grade_median.apply(lambda x: gr.get_fra(round(x,0)))
df2[['grade_fra','grade_median','name']].head(3)

     grade_fra  grade_median              name
8621    6c+/7a          47.5      120 tronkaes
8622    6a+/6b          40.0     45 aniversari
8623       5b+          33.0  almogaver tossut

You can also retrieve the grades info

In [7]:
gr.get_fra(64)

'8a+/8b'

In [8]:
gr.get_grade_id('8a')

61

In [10]:
gr.get_grades_fra()

['5a',
 '5b',
 '5c',
 '6a',
 '6a+',
 '6b',
 '6b+',
 '6c',
 '6c+',
 '7a',
 '7a+',
 '7b',
 '7b+',
 '7c',
 '7c+',
 '8a',
 '8a+',
 '8b',
 '8b+',
 '8c',
 '8c+',
 '9a',
 '9a+',
 '9b',
 '9b+']